In [1]:
import pandas as pd
from sklearn.preprocessing import OneHotEncoder

In [3]:
df=pd.DataFrame({'country':['usa','uae','france','india','australia']})

In [4]:
df

     country
0        usa
1        uae
2     france
3      india
4  australia

In [5]:
encoder=OneHotEncoder()

In [9]:
encoded=encoder.fit_transform(df[['country']]).toarray()

In [10]:
encoder_df=pd.DataFrame(encoded,columns=encoder.get_feature_names_out())

In [11]:
encoder_df

   country_australia  country_france  country_india  country_uae  country_usa
0                0.0             0.0            0.0          0.0          1.0
1                0.0             0.0            0.0          1.0          0.0
2                0.0             1.0            0.0          0.0          0.0
3                0.0             0.0            1.0          0.0          0.0
4                1.0             0.0            0.0          0.0          0.0

In [14]:
encoder.transform([['uae']]).toarray()

/opt/conda/lib/python3.10/site-packages/sklearn/base.py:409: UserWarning: X does not have valid feature names, but OneHotEncoder was fitted with feature names
  warnings.warn(

array([[0., 0., 0., 1., 0.]])

In [16]:
pd.concat([df,encoder_df],axis=1)

,country,country_australia,country_france,country_india,country_uae,country_usa
0,usa,0.0,0.0,0.0,0.0,1.0
1,uae,0.0,0.0,0.0,1.0,0.0
2,france,0.0,1.0,0.0,0.0,0.0
3,india,0.0,0.0,1.0,0.0,0.0
4,australia,1.0,0.0,0.0,0.0,0.0

In [18]:
import seaborn as sns
df=sns.load_dataset('tips')

In [32]:
dff=df['day'].head()

In [20]:
from sklearn.preprocessing import OneHotEncoder
encoder=OneHotEncoder()

In [25]:
encoded=encoder.fit_transform(df[['day']]).toarray()

In [27]:
encoder_df=pd.DataFrame(encoded,columns=encoder.get_feature_names_out())

In [28]:
encoder_df

     day_Fri  day_Sat  day_Sun  day_Thur
0        0.0      0.0      1.0       0.0
1        0.0      0.0      1.0       0.0
2        0.0      0.0      1.0       0.0
3        0.0      0.0      1.0       0.0
4        0.0      0.0      1.0       0.0
..       ...      ...      ...       ...
239      0.0      1.0      0.0       0.0
240      0.0      1.0      0.0       0.0
241      0.0      1.0      0.0       0.0
242      0.0      1.0      0.0       0.0
243      0.0      0.0      0.0       1.0

[244 rows x 4 columns]

In [36]:
pd.concat([dff,encoder_df],axis=1)

     day  day_Fri  day_Sat  day_Sun  day_Thur
0    Sun      0.0      0.0      1.0       0.0
1    Sun      0.0      0.0      1.0       0.0
2    Sun      0.0      0.0      1.0       0.0
3    Sun      0.0      0.0      1.0       0.0
4    Sun      0.0      0.0      1.0       0.0
..   ...      ...      ...      ...       ...
239  NaN      0.0      1.0      0.0       0.0
240  NaN      0.0      1.0      0.0       0.0
241  NaN      0.0      1.0      0.0       0.0
242  NaN      0.0      1.0      0.0       0.0
243  NaN      0.0      0.0      0.0       1.0

[244 rows x 5 columns]

In [39]:
df=pd.DataFrame({'country':['usa','uae','india','australia','france']})

In [40]:
df

     country
0        usa
1        uae
2      india
3  australia
4     france

In [41]:
from sklearn.preprocessing import LabelEncoder
lbl_encoder=LabelEncoder()

In [42]:
lbl_encoder.fit_transform(df[['country']])

/opt/conda/lib/python3.10/site-packages/sklearn/preprocessing/_label.py:116: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

array([4, 3, 2, 0, 1])

In [43]:
lbl_encoder.transform([['uae']])

/opt/conda/lib/python3.10/site-packages/sklearn/preprocessing/_label.py:134: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, dtype=self.classes_.dtype, warn=True)

array([3])

In [6]:
import pandas as pd
df=pd.DataFrame({'cricketer':['msd','kohli','sachin','rohit']})

In [7]:
df

  cricketer
0       msd
1     kohli
2    sachin
3     rohit

In [8]:
from sklearn.preprocessing import LabelEncoder
encoder=LabelEncoder()

In [9]:
encoder.fit_transform(df[['cricketer']])

/opt/conda/lib/python3.10/site-packages/sklearn/preprocessing/_label.py:116: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

array([1, 0, 3, 2])

In [12]:
encoder.transform([['kohli']])

array([0])

In [17]:
df

  cricketer
0       msd
1     kohli
2    sachin
3     rohit

In [18]:
from sklearn.preprocessing import OrdinalEncoder

In [23]:
df=pd.DataFrame({'size':['small','medium','large']})

In [24]:
df

     size
0   small
1  medium
2   large

In [25]:
encoder=OrdinalEncoder(categories=[['small','medium','large']])

In [26]:
encoder.fit_transform(df[['size']])

array([[0.],
       [1.],
       [2.]])

In [27]:
encoder.transform([['small']])

/opt/conda/lib/python3.10/site-packages/sklearn/base.py:409: UserWarning: X does not have valid feature names, but OrdinalEncoder was fitted with feature names
  warnings.warn(

array([[0.]])

In [35]:
import pandas as pd
df=pd.DataFrame({'city':['paris','london','newyork','paris','london','newyork'],'price':[500,400,300,200,200,200]})

In [36]:
df

      city  price
0    paris    500
1   london    400
2  newyork    300
3    paris    200
4   london    200
5  newyork    200

In [38]:
mean_price=df.groupby('city')['price'].mean().to_dict()

In [39]:
mean_price

{'london': 300.0, 'newyork': 250.0, 'paris': 350.0}

In [40]:
df['city_encode']=df['city'].map(mean_price)

In [43]:
df[['city','city_encode']]

      city  city_encode
0    paris        350.0
1   london        300.0
2  newyork        250.0
3    paris        350.0
4   london        300.0
5  newyork        250.0

In [44]:
import seaborn as sns
df=sns.load_dataset('tips')

In [45]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [51]:
mean_price=df.groupby('time')['total_bill'].mean().to_dict()

In [54]:
mean_price

{'Lunch': 17.168676470588235, 'Dinner': 20.79715909090909}

In [55]:
df['time_encode']=df['time'].map(mean_price)

In [57]:
df[['time','time_encode']]

       time time_encode
0    Dinner   20.797159
1    Dinner   20.797159
2    Dinner   20.797159
3    Dinner   20.797159
4    Dinner   20.797159
..      ...         ...
239  Dinner   20.797159
240  Dinner   20.797159
241  Dinner   20.797159
242  Dinner   20.797159
243  Dinner   20.797159

[244 rows x 2 columns]